# Problem 1

In [3]:
a = int(input('please enter number 1:'))
b = int(input('please enter number 2:'))
if a % 2== 0:
    print('Even')
else:
    print('odd')
if b % 2== 0:
    print('Even')
else:
    print('odd')

please enter number 1:2
please enter number 2:5
Even
odd

# Problem 2

In [5]:
q = int(input('please enter number 1:'))
r = int(input('please enter number 2:'))
s = q + r
Even = 'Even'
Odd = 'Odd'
if s % 2 == 0:
    print(Even)
else: 
    print(Odd)
if s == Even:
    print ('Player with even wiins')
else:
    print('Player with odd wins')

please enter number 1:2
please enter number 2:3
Odd
Player with odd wins

# Problem 3

In [7]:
 import pandas as pan

In [20]:
RnD_Spend = [26,55,67,78,33,45,34,76,89,90]
Administrator = [12111,12311,13411,14511,15611,16711,17811,18911,19011,10911]
Marketing_Spend = [9876,9765,3245,1425,6745,9745,4562,2563,8452,1423]
State = ['New York', 'California', 'Florida','New York', 'California', 'Florida','New York', 'California','Florida','New York']
Profit = [1345678,123456,123456,1234567,76543,987654,98765,456743,73823,87652,]

In [21]:
data = {'RnD_Spend: ':RnD_Spend,'Administrator :' : Administrator,'Marketing_Spend :' : Marketing_Spend,'State :' : State,'Profit :' : Profit}

In [22]:
data

{'RnD_Spend: ': [26, 55, 67, 78, 33, 45, 34, 76, 89, 90],
 'Administrator :': [12111,
  12311,
  13411,
  14511,
  15611,
  16711,
  17811,
  18911,
  19011,
  10911],
 'Marketing_Spend :': [9876,
  9765,
  3245,
  1425,
  6745,
  9745,
  4562,
  2563,
  8452,
  1423],
 'State :': ['New York',
  'California',
  'Florida',
  'New York',
  'California',
  'Florida',
  'New York',
  'California',
  'Florida',
  'New York'],
 'Profit :': [1345678,
  123456,
  123456,
  1234567,
  76543,
  987654,
  98765,
  456743,
  73823,
  87652]}

In [23]:
data = pan.DataFrame(data)

In [24]:
data

   RnD_Spend:   Administrator :  Marketing_Spend :     State :  Profit :
0           26            12111               9876    New York   1345678
1           55            12311               9765  California    123456
2           67            13411               3245     Florida    123456
3           78            14511               1425    New York   1234567
4           33            15611               6745  California     76543
5           45            16711               9745     Florida    987654
6           34            17811               4562    New York     98765
7           76            18911               2563  California    456743
8           89            19011               8452     Florida     73823
9           90            10911               1423    New York     87652

In [33]:
data.to_excel('data_table.xlsx')

# Problem 4

In [37]:
distance = int(input('Enter distance value here in Miles: '))
time = int(input('Enter time value here in Hours : '))
speed = distance / time 
print('the object is travelling in ',speed,'Miles per Hour')

Enter distance value here in Miles: 50
Enter time value here in Hours : 2
the object is travelling in  25.0 Miles per Hour